InformationRegisters/nsLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>nsLog</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УровеньЛога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.nsУровниЛога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/nsУровниЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>nsУровниЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросHTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветHTTP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/nsLog/Ext/ManagerModule.bsl
Функция ЗаписатьОшибку(Событие, КонтекстОшибки = Неопределено) Экспорт
	Возврат ЗаписатьЛог(Перечисления.nsУровниЛога.Ошибка, Событие, КонтекстОшибки);		
КонецФункции

Функция ЗаписатьИнформацию(Событие, КонтекстОшибки = Неопределено) Экспорт
	Возврат ЗаписатьЛог(Перечисления.nsУровниЛога.Информация, Событие, КонтекстОшибки);		
КонецФункции

Функция ЗаписатьЛог(УровеньЛога, Событие, КонтекстОшибки)
	
	Попытка
		Если ТипЗнч(Событие) = Тип("ИнформацияОбОшибке") Тогда
			СобытиеТекст = ПолучитьИнформациюОбОшибке(Событие);	
		ИначеЕсли ТипЗнч(Событие) = Тип("HTTPЗапрос") Тогда 
			СобытиеТекст = ПолучитьИнфоHTTPЗапрос(Событие);	
		ИначеЕсли ТипЗнч(Событие) = Тип("HTTPОтвет") Тогда 
			СобытиеТекст = ПолучитьИнфоHTTPОтвет(Событие);	
		Иначе	
			СобытиеТекст = Строка(Событие);	
		КонецЕсли; 
	Исключение
		СобытиеТекст = Строка(Событие);	
	КонецПопытки; 
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.nsLog.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.УровеньЛога = УровеньЛога;
		МенеджерЗаписи.КонтекстОшибки = КонтекстОшибки;
		МенеджерЗаписи.Событие = СобытиеТекст;
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки; 
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке, Параметр1 = Неопределено)
	
	ОшибкаТекст = ИнформацияОбОшибке.Описание + Символы.ПС +
		ИнформацияОбОшибке.ИмяМодуля + Символы.ПС +
		ИнформацияОбОшибке.НомерСтроки + Символы.ПС +
		ИнформацияОбОшибке.ИсходнаяСтрока;
		
	Если ЗначениеЗаполнено(Параметр1) Тогда
		ОшибкаТекст = ОшибкаТекст + Символы.ПС + Параметр1;	
	КонецЕсли; 	
	
	Возврат ОшибкаТекст;
КонецФункции
 
Функция ПолучитьИнфоHTTPЗапрос(Событие)
	// TODO надо получать детальную информацию из запроса
	Возврат Строка(Событие);
КонецФункции
 
Функция ПолучитьИнфоHTTPОтвет(Событие)
	// TODO надо получать детальную информацию из ответа
	Возврат Строка(Событие);
КонецФункции
